ubinos/nrf5sdk/source/nRF5_SDK/examples/iot/icmp/main.c
typedef enum
{
    LEDS_INACTIVE = 0,
    LEDS_CONNECTABLE_MODE,
    LEDS_IPV6_IF_DOWN,
    LEDS_IPV6_IF_UP,
    LEDS_BLINK_MODE
} display_state_t;

eui64_t                       eui64_local_iid;                                                      /**< Local EUI64 value that is used as the IID for SLAAC. */
static iot_interface_t      * mp_interface = NULL;                                                  /**< Pointer to IoT interface if any. */
static ipv6_medium_instance_t m_ipv6_medium;
static display_state_t        m_disp_state = LEDS_INACTIVE;                                         /**< Board LED display state. */
static uint8_t                m_blink_count = 0;                                                    /**< Number of LED flashes after successful operation. */
static bool                   m_led_feedback_enabled = false;                                       /**< If true, incoming ICMP packets are notified to the user. */

APP_TIMER_DEF(m_iot_timer_tick_src_id);                                                             /**< App timer instance used to update the IoT timer wall clock. */

/**@brief IPv6 well-known addresses. */
static const ipv6_addr_t      all_node_multicast_addr   = {{0xFF, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01}};
static const ipv6_addr_t      all_router_multicast_addr = {{0xFF, 0x02, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x02}};

#ifdef COMMISSIONING_ENABLED
static bool                    m_power_off_on_failure = false;
static bool                    m_identity_mode_active;
#endif // COMMISSIONING_ENABLED


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for the LEDs initialization.
 *
 * @details Initializes all LEDs used by this application.
 */
static void leds_init(void)
{
    // Configure LEDs.
    LEDS_CONFIGURE(LEDS_MASK);

    // Set LEDs off.
    LEDS_OFF(LEDS_MASK);
}


/**@brief Timer callback used for controlling board LEDs to represent application state.
 */
static void blink_timeout_handler(iot_timer_time_in_ms_t wall_clock_value)
{
    UNUSED_PARAMETER(wall_clock_value);

    static display_state_t previous_display_state;
#ifdef COMMISSIONING_ENABLED
    static bool id_mode_previously_enabled;
#endif // COMMISSIONING_ENABLED

#ifdef COMMISSIONING_ENABLED
    if (m_identity_mode_active == false)
    {
#endif // COMMISSIONING_ENABLED
    switch (m_disp_state)
    {
        case LEDS_INACTIVE:
        {
            LEDS_OFF(LEDS_MASK);
            break;
        }
        case LEDS_CONNECTABLE_MODE:
        {
            LEDS_INVERT(CONNECTABLE_MODE_LED);
            LEDS_OFF((CONNECTED_LED | RESPONSE_LED_1 | RESPONSE_LED_2));
            break;
        }
        case LEDS_IPV6_IF_DOWN:
        {
            LEDS_ON(CONNECTABLE_MODE_LED);
            LEDS_OFF((CONNECTED_LED | RESPONSE_LED_1 | RESPONSE_LED_2));
            break;
        }
        case LEDS_IPV6_IF_UP:
        {
            LEDS_ON(CONNECTED_LED);
            LEDS_OFF((CONNECTABLE_MODE_LED | RESPONSE_LED_1 | RESPONSE_LED_2));
            break;
        }
        case LEDS_BLINK_MODE:
        {
            if (previous_display_state != LEDS_BLINK_MODE)
            {
                LEDS_OFF(RESPONSE_LED_1 | RESPONSE_LED_2);
            }
            else
            {
                ++m_blink_count;
                if (m_blink_count < APP_MAX_LED_TOGGLE)
                {
                    LEDS_INVERT(RESPONSE_LED_1 | RESPONSE_LED_2);
                }
                else
                {
                    LEDS_OFF(RESPONSE_LED_1 | RESPONSE_LED_2);
                    m_disp_state = LEDS_IPV6_IF_UP;
                }
            }
            break;
        }
        default:
        {
            break;
        }
    }
#ifdef COMMISSIONING_ENABLED
    }
#endif // COMMISSIONING_ENABLED
    previous_display_state = m_disp_state;

#ifdef COMMISSIONING_ENABLED
    if ((id_mode_previously_enabled == false) && (m_identity_mode_active == true))
    {
        LEDS_ON(BSP_LED_0_MASK | BSP_LED_2_MASK);
        LEDS_OFF(BSP_LED_1_MASK | BSP_LED_3_MASK);
    }

    if ((id_mode_previously_enabled == true) && (m_identity_mode_active == true))
    {
        LEDS_INVERT(LEDS_MASK);
    }

    if ((id_mode_previously_enabled == true) && (m_identity_mode_active == false))
    {
        LEDS_OFF(LEDS_MASK);
    }

    id_mode_previously_enabled = m_identity_mode_active;
#endif // COMMISSIONING_ENABLED
}


/**@brief Function for indicating receive of ICMP response by blinking the LEDs.
 */
static void led_blinking_start()
{
    m_blink_count = 0;
    m_disp_state  = LEDS_BLINK_MODE;
    m_led_feedback_enabled = false;
}


/**@brief Function for handling button events.
 *
 * @param[in]   pin_no         The pin number of the button pressed.
 * @param[in]   button_action  The action performed on button.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    uint32_t                   err_code;
    ipv6_addr_t                src_addr;
    ipv6_addr_t                dest_addr;
    icmp6_ns_param_t           ns_param;
    iot_pbuffer_t            * p_buffer;
    iot_pbuffer_alloc_param_t  pbuff_param;

    // Check if interface is UP.
    if (mp_interface == NULL)
    {
#ifdef COMMISSIONING_ENABLED
        if ((button_action == APP_BUTTON_PUSH) && (pin_no == PING_PEER_BUTTON_PIN_NO))
        {
            APPL_LOG("Erasing all commissioning settings from persistent storage...\r\n");
            commissioning_settings_clear();
            return;
        }
#endif // COMMISSIONING_ENABLED
        return;
    }

    // Create Link Local address.
    IPV6_CREATE_LINK_LOCAL_FROM_EUI64(&src_addr, mp_interface->local_addr.identifier);

