ubinos/nrf5sdk/source/nRF5_SDK/examples/iot/icmp/main.c
    if (button_action == APP_BUTTON_PUSH)
    {
        m_led_feedback_enabled = true;

        switch (pin_no)
        {
            case NS_BUTTON_PIN_NO:
            {
                APPL_LOG("Sending Neighbour Solicitation to peer!\r\n");

                ns_param.add_aro      = true;
                ns_param.aro_lifetime = 1000;

                // Unicast address.
                IPV6_CREATE_LINK_LOCAL_FROM_EUI64(&ns_param.target_addr,
                                                  mp_interface->peer_addr.identifier);

                // Send Neighbor Solicitation to all nodes.
                err_code = icmp6_ns_send(mp_interface,
                                         &src_addr,
                                         &ns_param.target_addr,
                                         &ns_param);
                APP_ERROR_CHECK(err_code);
                break;
            }
            case RS_BUTTON_PIN_NO:
            {
                APPL_LOG("Sending Router Solicitation to all routers FF02::2!\r\n");

                // Send Router Solicitation to all routers.
                err_code = icmp6_rs_send(mp_interface,
                                         &src_addr,
                                         &all_router_multicast_addr);
                APP_ERROR_CHECK(err_code);
                break;
            }
            case PING_ALL_BUTTON_PIN_NO:
            {
                APPL_LOG("Ping all remote nodes using FF02::1 address!\r\n");

                pbuff_param.flags  = PBUFFER_FLAG_DEFAULT;
                pbuff_param.type   = ICMP6_PACKET_TYPE;
                pbuff_param.length = ICMP6_ECHO_REQUEST_PAYLOAD_OFFSET + 10;

                // Allocate packet buffer.
                err_code = iot_pbuffer_allocate(&pbuff_param, &p_buffer);
                APP_ERROR_CHECK(err_code);

                // Fill payload of Echo Request with 'A' letters.
                memset(p_buffer->p_payload + ICMP6_ECHO_REQUEST_PAYLOAD_OFFSET, 'A', 10);

                // Send Echo Request to all nodes.
                err_code = icmp6_echo_request(mp_interface, &src_addr, &all_node_multicast_addr, p_buffer);
                APP_ERROR_CHECK(err_code);
                break;
            }
            case PING_PEER_BUTTON_PIN_NO:
            {
                APPL_LOG("Ping peer device!\r\n");

                pbuff_param.flags  = PBUFFER_FLAG_DEFAULT;
                pbuff_param.type   = ICMP6_PACKET_TYPE;
                pbuff_param.length = ICMP6_ECHO_REQUEST_PAYLOAD_OFFSET + 10;

                // Allocate packet buffer.
                err_code = iot_pbuffer_allocate(&pbuff_param, &p_buffer);
                APP_ERROR_CHECK(err_code);

                // Unicast address.
                IPV6_CREATE_LINK_LOCAL_FROM_EUI64(&dest_addr,
                                                  mp_interface->peer_addr.identifier);

                // Fill payload of Echo Request with 'B' letters.
                memset(p_buffer->p_payload + ICMP6_ECHO_REQUEST_PAYLOAD_OFFSET, 'A', 10);

                // Send Echo Request to all nodes.
                err_code = icmp6_echo_request(mp_interface, &src_addr, &dest_addr, p_buffer);
                APP_ERROR_CHECK(err_code);
                break;
            }

            default:
            {
                m_led_feedback_enabled = false;
                break;
            }
        }
    }
}


/**@brief Function for updating the wall clock of the IoT Timer module.
 */
static void iot_timer_tick_callback(void * p_context)
{
    UNUSED_VARIABLE(p_context);
    uint32_t err_code = iot_timer_update();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_ERROR_CHECK(app_timer_init());

    // Initialize timer instance as a tick source for IoT timer.
    err_code = app_timer_create(&m_iot_timer_tick_src_id,
                                APP_TIMER_MODE_REPEATED,
                                iot_timer_tick_callback);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the IoT Timer. */
static void iot_timer_init(void)
{
    uint32_t err_code;

    static const iot_timer_client_t list_of_clients[] =
    {
        {blink_timeout_handler,   LED_BLINK_INTERVAL_MS},
#ifdef COMMISSIONING_ENABLED
        {commissioning_time_tick, SEC_TO_MILLISEC(COMMISSIONING_TICK_INTERVAL_SEC)}
#endif // COMMISSIONING_ENABLED
    };

    // The list of IoT Timer clients is declared as a constant.
    static const iot_timer_clients_list_t iot_timer_clients =
    {
        (sizeof(list_of_clients) / sizeof(iot_timer_client_t)),
        &(list_of_clients[0]),
    };

    // Passing the list of clients to the IoT Timer module.
    err_code = iot_timer_client_list_set(&iot_timer_clients);
    APP_ERROR_CHECK(err_code);

    // Starting the app timer instance that is the tick source for the IoT Timer.
    err_code = app_timer_start(m_iot_timer_tick_src_id,
                               APP_TIMER_TICKS(IOT_TIMER_RESOLUTION_IN_MS),
                               NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Button initialization.
 *
 * @details Initializes all Buttons used by this application.
 */
static void buttons_init(void)
{
    uint32_t err_code;

    static app_button_cfg_t buttons[] =
    {
        {NS_BUTTON_PIN_NO,          false, BUTTON_PULL, button_event_handler},
        {RS_BUTTON_PIN_NO,          false, BUTTON_PULL, button_event_handler},
        {PING_ALL_BUTTON_PIN_NO,    false, BUTTON_PULL, button_event_handler},
        {PING_PEER_BUTTON_PIN_NO,   false, BUTTON_PULL, button_event_handler}
    };

    #define BUTTON_DETECTION_DELAY APP_TIMER_TICKS(50)

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);

